houjunzyt/STM32F429/STemWin5.40/Config/emWin_Drive.c
#include <string.h>
#include "GUI.h"
#include "GUI_Private.h"
#include "GUIDRV_Lin.h"
#include "stm32f4xx.h"
#include "lcd_rgb.h"
#include <rtthread.h>

//extern uint32_t LCD_MemoryAdd;

#undef  LCD_SWAP_XY
#undef  LCD_MIRROR_Y

#define LCD_SWAP_XY  0
#define LCD_MIRROR_Y 1

#define XSIZE_PHYS LCD_Width		// 显示屏长度
#define YSIZE_PHYS LCD_Height		// 显示屏宽度

#define XSIZE_0 XSIZE_PHYS
#define YSIZE_0 YSIZE_PHYS

// 多缓冲个数，最大支持3缓冲，开启多缓冲可以让动态绘图更加流畅
// 此处只是定义多缓冲的个数，在程序中还需另外调用函数开启多缓冲功能
//	可调用 WM_MULTIBUF_Enable(1) 让窗口管理器自动使用多缓冲
//
#define NUM_BUFFERS  3 		

//	虚拟屏幕的个数，emWin不支持多缓冲和虚拟屏幕同时使用
//
#define NUM_VSCREENS 1 

//	定义图层数，STM32F429最大支持双图层
//	若使用双图层，通过 GUI_SelectLayer() 函数来切换所要显示的图层

#undef  GUI_NUM_LAYERS
#define GUI_NUM_LAYERS 1

#if (GUI_NUM_LAYERS > 1)
  #define XSIZE_1 XSIZE_PHYS
  #define YSIZE_1 YSIZE_PHYS
#endif


//	设置每个图层所使用的显存，429最大支持双图层
//	本例程给LTDC划分的显存为每层 480*272*4*3 字节，预留了32位色开双层显示以及使用三缓冲的空间，
//	用户可根据自己的实际应用进行调整,在 lcd_rgb.h 和 GUIConf.c 里进行配置
//
//extern uint32_t LCD_LAYER0_FRAME_BUFFER;									
//extern uint32_t LCD_LAYER1_FRAME_BUFFER;
#define LCD_LAYER0_FRAME_BUFFER  LCD_MemoryAdd									
#define LCD_LAYER1_FRAME_BUFFER  LCD_MemoryAdd + LCD_MemoryAdd_OFFSET	

// 配置 emWin 每个图层的颜色格式，支持8位色、16位色、24位色以及32位色，用户可根据需要进行配置
//	需要给每个图层合理的划分显存，假设使用16位色、三缓冲，则该图层占用 480*272*2*3 字节的SDRAM空间
//	为了方便使用，本例程给LTDC划分的显存为每层 800*480*4*3 字节，预留了32位色开双层显示以及使用三缓冲的空间，
//	用户可根据自己的实际应用进行显存的调整,在 lcd_rgb.h 和 GUIConf.c 里进行配置
//

#define COLOR_CONVERSION_0 GUICC_M8888I			// ARGB8888 格式，32位色，带8位的透明色，一般只在双图层下使用
#define DISPLAY_DRIVER_0   GUIDRV_LIN_32		

//#define COLOR_CONVERSION_0 GUICC_M888			// RGB888 格式，24位色
//#define DISPLAY_DRIVER_0   GUIDRV_LIN_24

//#define COLOR_CONVERSION_0 GUICC_M1555I			// ARGB1555格式，16位色，带1位透明色，一般只在双图层下使用
//#define DISPLAY_DRIVER_0   GUIDRV_LIN_16

//#define COLOR_CONVERSION_0 GUICC_M565			// RGB565 格式，16位色，最常用的颜色格式
//#define DISPLAY_DRIVER_0   GUIDRV_LIN_16

//#define COLOR_CONVERSION_0 GUICC_M4444I			// ARGB4444格式，16位色，带4位透明色，一般只在双图层下使用
//#define DISPLAY_DRIVER_0   GUIDRV_LIN_16

//#define COLOR_CONVERSION_0 GUICC_8666			// L8格式，8位色，占用的开销最低，对颜色要求不高的场合可使用，具有很高的使用价值
//#define DISPLAY_DRIVER_0   GUIDRV_LIN_8
 

  
#if (GUI_NUM_LAYERS > 1)

  #define COLOR_CONVERSION_1 GUICC_M8888I			// ARGB8888 格式，32位色，带8位的透明色，一般只在双图层下使用
  #define DISPLAY_DRIVER_1   GUIDRV_LIN_32
 
//  #define COLOR_CONVERSION_1 GUICC_M888			// RGB888 格式，24位色
//  #define DISPLAY_DRIVER_1   GUIDRV_LIN_24

//  #define COLOR_CONVERSION_1 GUICC_M1555I		// ARGB1555格式，16位色，带1位透明色，一般只在双图层下使用
//  #define DISPLAY_DRIVER_1   GUIDRV_LIN_16  

//  #define COLOR_CONVERSION_1 GUICC_M565			// RGB565 格式，16位色，最常用的颜色格式
//  #define DISPLAY_DRIVER_1   GUIDRV_LIN_16

//  #define COLOR_CONVERSION_1 GUICC_M4444I		// ARGB4444格式，16位色，带4位透明色，一般只在双图层下使用
//  #define DISPLAY_DRIVER_1   GUIDRV_LIN_16  

//  #define COLOR_CONVERSION_1 GUICC_8666			// L8格式，8位色，占用的开销最低，对颜色要求不高的场合可使用，具有很高的使用价值
//  #define DISPLAY_DRIVER_1   GUIDRV_LIN_8
  
#endif

/************************************************ 以下为底层驱动，用户无需修改 ***************************************************************************/


/* Private macro -------------------------------------------------------------*/
/* Redirect bulk conversion to DMA2D routines */
#define DEFINEDMA2D_COLORCONVERSION(PFIX, PIXELFORMAT)                                                             \
static void Color2IndexBulk_##PFIX##DMA2D(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex) { \
  DMA_Color2IndexBulk(pColor, pIndex, NumItems, SizeOfIndex, PIXELFORMAT);                                         \
}                                                                                                                   \
static void _Index2ColorBulk_##PFIX##DMA2D(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex) { \
  DMA_Index2ColorBulk(pIndex, pColor, NumItems, SizeOfIndex, PIXELFORMAT);                                         \
}

/* Private variables ---------------------------------------------------------*/
static LTDC_Layer_TypeDef     * apLayer[]      = { LTDC_Layer1, LTDC_Layer2 };
static uint32_t                 layer_address[GUI_NUM_LAYERS];
static __IO int32_t             layer_pending_buffer[GUI_NUM_LAYERS];
static uint32_t                 layer_buffer_index[GUI_NUM_LAYERS];
static uint32_t                 layer_xsize[GUI_NUM_LAYERS];
static uint32_t                 layer_ysize[GUI_NUM_LAYERS];
static uint32_t                 layer_bpp[GUI_NUM_LAYERS];

static const LCD_API_COLOR_CONV * apColorConvAPI[] = 
{
  COLOR_CONVERSION_0,
#if GUI_NUM_LAYERS > 1
  COLOR_CONVERSION_1,
#endif
};

static U32 aBufferDMA2D[XSIZE_PHYS * sizeof(U32)];
static U32 aBuffer_FG   [XSIZE_PHYS * sizeof(U32)];
static U32 aBuffer_BG   [XSIZE_PHYS * sizeof(U32)];

/* Private function prototypes -----------------------------------------------*/

static void DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat);
static void DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat);

DEFINEDMA2D_COLORCONVERSION(M8888I, LTDC_Pixelformat_ARGB8888)
DEFINEDMA2D_COLORCONVERSION(M888,   LTDC_Pixelformat_ARGB8888)
DEFINEDMA2D_COLORCONVERSION(M565,   LTDC_Pixelformat_RGB565)
DEFINEDMA2D_COLORCONVERSION(M1555I, LTDC_Pixelformat_ARGB1555)
DEFINEDMA2D_COLORCONVERSION(M4444I, LTDC_Pixelformat_ARGB4444)

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  
  * @param  LayerIndex: Layer index
  * @retval The LTDC Pixel format
  */
static U32 GetPixelformat(int LayerIndex) 
{
  const LCD_API_COLOR_CONV * pColorConvAPI;
  
  if (LayerIndex >= GUI_COUNTOF(apColorConvAPI)) 
  {
    return 0;
  }
  pColorConvAPI = apColorConvAPI[LayerIndex];
  
  if(pColorConvAPI == GUICC_M8888I) 
  {
    return LTDC_Pixelformat_ARGB8888;
  } 
  
  else if (pColorConvAPI == GUICC_M888) 
  {
    return LTDC_Pixelformat_RGB888;
  } 
  
  else if (pColorConvAPI == GUICC_M565) 
  {
    return LTDC_Pixelformat_RGB565;
  } 
  
  else if (pColorConvAPI == GUICC_M1555I) 
  {
    return LTDC_Pixelformat_ARGB1555;
  } 
  
  else if (pColorConvAPI == GUICC_M4444I) 
  {
    return LTDC_Pixelformat_ARGB4444;
  } 
  
  else if (pColorConvAPI == GUICC_8666) 
  {
    return LTDC_Pixelformat_L8;
  } 
  
  else if (pColorConvAPI == GUICC_1616I) 
  {
    return LTDC_Pixelformat_AL44;
  } 
  
